ss = "Sammy Shark!"
print(ss[4])  # แสดงตัวอักษรที่ตำแหน่ง 4 ของ ss
print(ss[6:11])  # แสดงตัวอักษรตั้งแต่ตำแหน่ง 6 ถึง 10 ของ ss
print(ss[:5])  # แสดงตัวอักษรตั้งแต่ตำแหน่งเริ่มต้นถึง 4 ของ ss
print(ss[7:])  # แสดงตัวอักษรตั้งแต่ตำแหน่ง 7 ถึงสิ้นสุดของ ss
print(ss[-4:-1])  # แสดงตัวอักษรตั้งแต่ตำแหน่ง -4 ถึง -2 ของ ss
print(ss[6:11])  # แสดงตัวอักษรตั้งแต่ตำแหน่ง 6 ถึง 10 ของ ss
print(ss[6:11:1])  # แสดงตัวอักษรตั้งแต่ตำแหน่ง 6 ถึง 10 ของ ss โดยข้ามทุกๆ 1 ตำแหน่ง
print(ss[6:11:2])  # แสดงตัวอักษรตั้งแต่ตำแหน่ง 6 ถึง 10 ของ ss โดยข้ามทุกๆ 2 ตำแหน่ง
print(ss[6:11:4])  # แสดงตัวอักษรตั้งแต่ตำแหน่ง 6 ถึง 10 ของ ss โดยข้ามทุกๆ 4 ตำแหน่ง
print(ss[::4]) # แสดงตัวอักษรทั้งหมดใน ss โดยข้ามทุกๆ 4 ตำแหน่ง
print(ss[::-1])  # แสดงตัวอักษรทั้งหมดใน ss ในลำดับย้อนกลับ
print(ss[::-2])  # แสดงตัวอักษรทั้งหมดใน ss ในลำดับย้อนกลับ โดยข้ามทุกๆ 2 ตำแหน่ง
